1. wczytac plik orders_example.csv
2. 5 pierwszych, 5 ostatnich
3. informacje
4. dane statystyczne
5 sprawdzic duplikaty
6 sprawdzic null

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("data/orders_example.csv")
df

,order_id,customer_id,product,category,price,quantity,score,country,order_date
0,1001,C01,Laptop,Electronics,3500.0,1,95.0,Poland,2024-03-01
1,1002,C02,Mouse,Accessories,120.0,2,NaN,Germany,2024-03-03
2,1003,C03,Smartphone,Electronics,NaN,1,80.0,Poland,2024-03-07
3,1004,C04,Headphones,Accessories,450.0,1,89.0,France,2024-03-08
4,1005,C01,Monitor,Electronics,999.0,2,30.0,Poland,2024-03-10
5,1006,C05,Power Bank,Accessories,85.0,3,92.0,Czechia,2024-03-12

In [3]:
df.head()

,order_id,customer_id,product,category,price,quantity,score,country,order_date
0,1001,C01,Laptop,Electronics,3500.0,1,95.0,Poland,2024-03-01
1,1002,C02,Mouse,Accessories,120.0,2,NaN,Germany,2024-03-03
2,1003,C03,Smartphone,Electronics,NaN,1,80.0,Poland,2024-03-07
3,1004,C04,Headphones,Accessories,450.0,1,89.0,France,2024-03-08
4,1005,C01,Monitor,Electronics,999.0,2,30.0,Poland,2024-03-10

In [4]:
df.tail()

,order_id,customer_id,product,category,price,quantity,score,country,order_date
1,1002,C02,Mouse,Accessories,120.0,2,NaN,Germany,2024-03-03
2,1003,C03,Smartphone,Electronics,NaN,1,80.0,Poland,2024-03-07
3,1004,C04,Headphones,Accessories,450.0,1,89.0,France,2024-03-08
4,1005,C01,Monitor,Electronics,999.0,2,30.0,Poland,2024-03-10
5,1006,C05,Power Bank,Accessories,85.0,3,92.0,Czechia,2024-03-12

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 9 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   order_id     6 non-null      int64
 1   customer_id  6 non-null      object
 2   product      6 non-null      object
 3   category     6 non-null      object
 4   price        5 non-null      float64
 5   quantity     6 non-null      int64
 6   score        5 non-null      float64
 7   country      6 non-null      object
 8   order_date   6 non-null      object
dtypes: float64(2), int64(2), object(5)
memory usage: 564.0+ bytes

In [6]:
df.describe()

          order_id        price  quantity      score
count     6.000000     5.000000  6.000000   5.000000
mean   1003.500000  1030.800000  1.666667  77.200000
std       1.870829  1428.231669  0.816497  26.975915
min    1001.000000    85.000000  1.000000  30.000000
25%    1002.250000   120.000000  1.000000  80.000000
50%    1003.500000   450.000000  1.500000  89.000000
75%    1004.750000   999.000000  2.000000  92.000000
max    1006.000000  3500.000000  3.000000  95.000000

In [7]:
df.duplicated().any()

np.False_

In [8]:
df.isnull().sum()

order_id       0
customer_id    0
product        0
category       0
price          1
quantity       0
score          1
country        0
order_date     0
dtype: int64

usunąc, zamienic: srednią, medianą

In [10]:
df['price'].fillna(df['price'].mean(), inplace=True)

In [11]:
df['price'] = df['price'].fillna(df['price'].mean())

score, median

In [12]:
df['score'] = df['score'].fillna(df['score'].median())

In [13]:
df

,order_id,customer_id,product,category,price,quantity,score,country,order_date
0,1001,C01,Laptop,Electronics,3500.0,1,95.0,Poland,2024-03-01
1,1002,C02,Mouse,Accessories,120.0,2,89.0,Germany,2024-03-03
2,1003,C03,Smartphone,Electronics,1030.8,1,80.0,Poland,2024-03-07
3,1004,C04,Headphones,Accessories,450.0,1,89.0,France,2024-03-08
4,1005,C01,Monitor,Electronics,999.0,2,30.0,Poland,2024-03-10
5,1006,C05,Power Bank,Accessories,85.0,3,92.0,Czechia,2024-03-12

In [14]:
df.describe()

          order_id       price  quantity      score
count     6.000000     6.00000  6.000000   6.000000
mean   1003.500000  1030.80000  1.666667  79.166667
std       1.870829  1277.44924  0.816497  24.604200
min    1001.000000    85.00000  1.000000  30.000000
25%    1002.250000   202.50000  1.000000  82.250000
50%    1003.500000   724.50000  1.500000  89.000000
75%    1004.750000  1022.85000  2.000000  91.250000
max    1006.000000  3500.00000  3.000000  95.000000

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 9 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   order_id     6 non-null      int64
 1   customer_id  6 non-null      object
 2   product      6 non-null      object
 3   category     6 non-null      object
 4   price        6 non-null      float64
 5   quantity     6 non-null      int64
 6   score        6 non-null      float64
 7   country      6 non-null      object
 8   order_date   6 non-null      object
dtypes: float64(2), int64(2), object(5)
memory usage: 564.0+ bytes

In [16]:
df.isnull().sum()

order_id       0
customer_id    0
product        0
category       0
price          0
quantity       0
score          0
country        0
order_date     0
dtype: int64

Kwantyle
wartośści odstające IQR

In [17]:
Q1 = df['score'].quantile(0.25)
Q3 = df['score'].quantile(0.75)

In [18]:
IQR = Q3 - Q1
IQR

np.float64(9.0)

In [19]:
outliers = df[df['score'] > Q3 + 1.5 * IQR]
outliers

Empty DataFrame
Columns: [order_id, customer_id, product, category, price, quantity, score, country, order_date]
Index: []

In [20]:
median_score = df['score'].median()
df.loc[df['score'] > Q3 + 1.5 * IQR, 'score'] = median_score
df

,order_id,customer_id,product,category,price,quantity,score,country,order_date
0,1001,C01,Laptop,Electronics,3500.0,1,95.0,Poland,2024-03-01
1,1002,C02,Mouse,Accessories,120.0,2,89.0,Germany,2024-03-03
2,1003,C03,Smartphone,Electronics,1030.8,1,80.0,Poland,2024-03-07
3,1004,C04,Headphones,Accessories,450.0,1,89.0,France,2024-03-08
4,1005,C01,Monitor,Electronics,999.0,2,30.0,Poland,2024-03-10
5,1006,C05,Power Bank,Accessories,85.0,3,92.0,Czechia,2024-03-12

Posortowac wg order_date

In [21]:
df.sort_values(by="order_date")

,order_id,customer_id,product,category,price,quantity,score,country,order_date
0,1001,C01,Laptop,Electronics,3500.0,1,95.0,Poland,2024-03-01
1,1002,C02,Mouse,Accessories,120.0,2,89.0,Germany,2024-03-03
2,1003,C03,Smartphone,Electronics,1030.8,1,80.0,Poland,2024-03-07
3,1004,C04,Headphones,Accessories,450.0,1,89.0,France,2024-03-08
4,1005,C01,Monitor,Electronics,999.0,2,30.0,Poland,2024-03-10
5,1006,C05,Power Bank,Accessories,85.0,3,92.0,Czechia,2024-03-12

In [22]:
df[(df['country'] == "Poland") & (df['score'] > 85)]

,order_id,customer_id,product,category,price,quantity,score,country,order_date
0,1001,C01,Laptop,Electronics,3500.0,1,95.0,Poland,2024-03-01

In [23]:
df.query("category == 'Electronics' and price > 1000")

,order_id,customer_id,product,category,price,quantity,score,country,order_date
0,1001,C01,Laptop,Electronics,3500.0,1,95.0,Poland,2024-03-01
2,1003,C03,Smartphone,Electronics,1030.8,1,80.0,Poland,2024-03-07

Pogrupowac wg category ale po dwoch kolumnach: order_id, score

In [24]:
df.groupby('category').agg({"order_id": "count"})

             order_id
category
Accessories         3
Electronics         3

In [25]:
df.groupby('category').agg({"order_id": "count", "score":'mean'})

             order_id      score
category
Accessories         3  90.000000
Electronics         3  68.333333

In [26]:
df.pivot_table(values="price", index="country", aggfunc="mean")

               price
country
Czechia    85.000000
France    450.000000
Germany   120.000000
Poland   1843.266667

za pomoca groupby()

In [27]:
df.groupby('country')['price'].mean()

country
Czechia      85.000000
France      450.000000
Germany     120.000000
Poland     1843.266667
Name: price, dtype: float64

In [28]:
dane = df.groupby('category').agg({"order_id": "count", "score":'mean'})
dane

             order_id      score
category
Accessories         3  90.000000
Electronics         3  68.333333

In [29]:
dane.info()

<class 'pandas.core.frame.DataFrame'>
Index: 2 entries, Accessories to Electronics
Data columns (total 2 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   order_id  2 non-null      int64
 1   score     2 non-null      float64
dtypes: float64(1), int64(1)
memory usage: 48.0+ bytes